Repository: nocksapp/nocks-crypto-for-woocommerce
Catalog: languages/nocks-checkout-for-woocommerce-*.po
Languages: nl_nl

source: Pay with Gulden
nl_nl: Betaal met Gulden

source: Pay with Bitcoin
nl_nl: Betaal met Bitcoin

source: Pay with Litecoin
nl_nl: Betaal met Litecoin

source: Pay with Ethereum
nl_nl: Betaal met Ethereum

source: Estimated total amount of Gulden:
nl_nl: Geschatte Gulden bedrag:

source: We cannot calculate the amount of Guldens at this moment.
nl_nl: We kunnen het Gulden bedrag op dit moment niet berekenen.

source: Estimated total amount of Bitcoin:
nl_nl: Geschatte Bitcoin bedrag:

source: We cannot calculate the amount of Bitcoins at this moment.
nl_nl: We kunnen het Bitcoin bedrag op dit moment niet berekenen.

source: Estimated total amount of Litecoin:
nl_nl: Geschatte Litecoin bedrag:

source: We cannot calculate the amount of Litecoins at this moment.
nl_nl: We kunnen het Litecoin bedrag op dit moment niet berekenen.

source: Estimated total amount of Ethereum:
nl_nl: Geschatte Ethereum bedrag:

source: We cannot calculate the amount of Ethereums at this moment.
nl_nl: We kunnen het Ethereum bedrag op dit moment niet berekenen.

source: Your payment has been cancelled.
nl_nl: Uw betaling is geannuleerd

source: We have not received a definite payment status. You will receive an email as soon as we receive a confirmation.
nl_nl: We hebben nog geen betaling ontvangen. U zal een mail ontvangen zodra we bevestiging hebben.

source: Payment completed with <strong>%s</strong>
nl_nl: Betaling afgerond met <strong>%s</strong>
